Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes
The possible shapes of the section mark symbol.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.None
No symbol.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.SymbolShape1
The triangle with black and white halves.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.SymbolShape2
The arrow line pointing to an orthogonal straight line.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.SymbolShape3
The line with half of an arrow end.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.SymbolShape4
The rectangle shape with very small height.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.SymbolShape5
The triangle and circle shapes mixed. The circle partly hides the triangle.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.SymbolShape6
The triangle and circle shapes mixed. The triangle is on top.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.SymbolShape7
The triangle shape without content.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.SymbolShape8
The triangle shape filled in black.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol.SymbolShapes.Custom
The custom shape.